Stellaris-code/stm32h747i-xash3d/BSP/STM32CubeIDE/CM7/Example/User/CM7/engine/ref/soft/r_image.c
	tex->fogParams[0] = pic->fogParams[0];
	tex->fogParams[1] = pic->fogParams[1];
	tex->fogParams[2] = pic->fogParams[2];
	tex->fogParams[3] = pic->fogParams[3];
	GL_SetTextureDimensions( tex, pic->width, pic->height, pic->depth );
	GL_SetTextureFormat( tex, pic->type, pic->flags );

	//gEngfuncs.Con_Printf("%s %d %d\n", tex->name, tex->width, tex->height );

	Assert( pic != NULL );
	Assert( tex != NULL );

	if( !pic->buffer )
		return true;

	buf = pic->buffer;

	mipCount = 4;//GL_CalcMipmapCount( tex, ( buf != NULL ));

	// STM32
#ifdef NOMIPMAPS
	mipCount = 1;
#endif

	// NOTE: only single uncompressed textures can be resamples, no mips, no layers, no sides
	if((( pic->width != tex->width ) || ( pic->height != tex->height )))
		data = GL_ResampleTexture( buf, pic->width, pic->height, tex->width, tex->height, normalMap );
	else data = buf;

	//if( !ImageDXT( pic->type ) && !FBitSet( tex->flags, TF_NOMIPMAP ) && FBitSet( pic->flags, IMAGE_ONEBIT_ALPHA ))
	//	data = GL_ApplyFilter( data, tex->width, tex->height );

	// mips will be auto-generated if desired
	for( j = 0; j < mipCount; j++ )
	{
	int x, y;
		width = Q_max( 1, ( tex->width >> j ));
		height = Q_max( 1, ( tex->height >> j ));
		texsize = GL_CalcTextureSize( width, height, tex->depth );
		size = GL_CalcImageSize( pic->type, width, height, tex->depth );
		//GL_TextureImageRAW( tex, i, j, width, height, tex->depth, pic->type, data );
		// increase size to workaround triangle renderer bugs
		// it seems to assume memory readable. maybe it was pointed to WAD?
		//tex->pixels[j] = (byte*)Mem_Calloc( r_temppool, width * height * sizeof(pixel_t) + 1024 ) + 512;



		tex->pixels[j] = (pixel_t*)Mem_Calloc( r_temppool, width * height * sizeof(pixel_t) );


		//memset( (byte*)tex->pixels[j] - 512, 0xFF, 512 );
		//memset( (byte*)tex->pixels[j] + width * height * sizeof(pixel_t), 0xFF, 512 );

		if( j == 0 &&  tex->flags & TF_HAS_ALPHA )
			tex->alpha_pixels = (pixel_t*)Mem_Calloc( r_temppool, width * height * sizeof(pixel_t) );

		for(i = 0; i < height * width; i++ )
		{
				unsigned int r, g, b, major, minor;
		#if 0
				r = data[i * 4 + 0] * MASK(5-1) / 255;
				g = data[i * 4 + 1] * MASK(6-1) / 255;
				b = data[i * 4 + 2] * MASK(5-1) / 255;
		#else
				// seems to look better
				r = data[i * 4 + 0] * BIT(5) / 256;
				g = data[i * 4 + 1] * BIT(6) / 256;
				b = data[i * 4 + 2] * BIT(5) / 256;
		#endif
				// 565 to 332
				major = (((r >> 2) & MASK(3)) << 5) |( (( (g >> 3) & MASK(3)) << 2 )  )| (((b >> 3) & MASK(2)));

				// save minor GBRGBRGB
				minor = MOVE_BIT(r,1,5) | MOVE_BIT(r,0,2) | MOVE_BIT(g,2,7) | MOVE_BIT(g,1,4) | MOVE_BIT(g,0,1) | MOVE_BIT(b,2,6)| MOVE_BIT(b,1,3)|MOVE_BIT(b,0,0);

				tex->pixels[j][i] = major << 8 | (minor & 0xFF);
				if( j == 0 && tex->alpha_pixels )
				{
					unsigned int alpha = (data[i * 4 + 3] * 8 / 256) << (16 - 3);
					tex->alpha_pixels[i] = (tex->pixels[j][i] >> 3) | alpha;

					// <STM MOD>
					if( !sw_noalphabrushes->value && data[i * 4 + 3] < 128 && FBitSet( pic->flags, IMAGE_ONEBIT_ALPHA ) )
						tex->pixels[j][i] = TRANSPARENT_COLOR; //0000 0011 0100 1001;
				}

		}

		// <STM MOD> : upload wall textures to QSPI Flash (teh surface cache nullifies the effects of the QSPI flash latency)
#if 1
		//if (tex->type != it_skin)
		//if (height * width > 64*64)
		{
			static int counter = 0;

			int ret = BSP_QSPI_DisableMemoryMappedMode(0);
			assert(ret == BSP_ERROR_NONE);

			// Chip is erased during startup
			// 128MiB available
			if (counter + (width * height * sizeof(pixel_t)) >= 128*1024*1024)
			{
				// On a atteint la fin de la flash? On efface tout et on reboucle
				ret = BSP_QSPI_EraseChip(0);
				assert(ret == BSP_ERROR_NONE);
				counter = 0;
			}
			uint32_t qspi_addr = counter;

			// Weird offset required, dont ask why. srsly dont
			ret = BSP_QSPI_Write(0, tex->pixels[j] - 3, qspi_addr, 6 + width * height * sizeof(pixel_t));
			assert(ret == BSP_ERROR_NONE);

			counter += width * height * sizeof(pixel_t);
			// Alignement à la page suivante
			if (counter % 256 != 0)
			{
				counter &= ~255;
				counter += 256;
			}

			ret = BSP_QSPI_EnableMemoryMappedMode(0);
			assert(ret == BSP_ERROR_NONE);

			Mem_Free(tex->pixels[j]);
			tex->pixels[j] = 0x90000000 + qspi_addr;
		}
#endif

		if( mipCount > 1 )
			GL_BuildMipMap( data, width, height, tex->depth, tex->flags );

		tex->size += texsize;
		tex->numMips++;

		//GL_CheckTexImageError( tex );
	}

#if 0


	GL_SetTextureTarget( tex, pic ); // must be first

	// make sure what target is correct
	if( tex->target == GL_NONE )
	{
		gEngfuncs.Con_DPrintf( S_ERROR "GL_UploadTexture: %s is not supported by your hardware\n", tex->name );
		return false;
	}

	GL_SetTextureDimensions( tex, pic->width, pic->height, pic->depth );
	GL_SetTextureFormat( tex, pic->type, pic->flags );

	tex->fogParams[0] = pic->fogParams[0];
	tex->fogParams[1] = pic->fogParams[1];
	tex->fogParams[2] = pic->fogParams[2];
	tex->fogParams[3] = pic->fogParams[3];

	if(( pic->width * pic->height ) & 3 )
	{
		// will be resampled, just tell me for debug targets
		gEngfuncs.Con_Reportf( "GL_UploadTexture: %s s&3 [%d x %d]\n", tex->name, pic->width, pic->height );
	}

	buf = pic->buffer;
	bufend = pic->buffer + pic->size; // total image size include all the layers, cube sides, mipmaps
	offset = GL_CalcImageSize( pic->type, pic->width, pic->height, pic->depth );
	texsize = GL_CalcTextureSize( tex->format, tex->width, tex->height, tex->depth );
	normalMap = FBitSet( tex->flags, TF_NORMALMAP ) ? true : false;
	numSides = FBitSet( pic->flags, IMAGE_CUBEMAP ) ? 6 : 1;

	// uploading texture into video memory, change the binding
	glState.currentTextures[glState.activeTMU] = tex->texnum;
	pglBindTexture( tex->target, tex->texnum );

	for( i = 0; i < numSides; i++ )
	{
		// track the buffer bounds
		if( buf != NULL && buf >= bufend )
			gEngfuncs.Host_Error( "GL_UploadTexture: %s image buffer overflow\n", tex->name );

		if( ImageDXT( pic->type ))
		{
			for( j = 0; j < Q_max( 1, pic->numMips ); j++ )
			{
				width = Q_max( 1, ( tex->width >> j ));
				height = Q_max( 1, ( tex->height >> j ));
				texsize = GL_CalcTextureSize( tex->format, width, height, tex->depth );
				size = GL_CalcImageSize( pic->type, width, height, tex->depth );
				GL_TextureImageDXT( tex, i, j, width, height, tex->depth, size, buf );
				tex->size += texsize;
				buf += size; // move pointer
				tex->numMips++;

